Revit 2027 API
MechanicalEquipment Class
Provides access to the Mechanical Equipment in Autodesk Revit MEP.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.MEPModel
 Autodesk.Revit.DB.Mechanical.MechanicalEquipment
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MechanicalEquipment : MEPModel
Public Class MechanicalEquipment
	Inherits MEPModel
public ref class MechanicalEquipment : public MEPModel
type MechanicalEquipment =
    class
        inherit MEPModel
    end
The MechanicalEquipment type exposes the following members.
Properties
Name | Description
ConnectorManager |  Retrieves the Connector Manager from this MEPModel.
(Inherited from MEPModel)
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from MEPModel)
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAssignedElectricalSystems |  Retrieves the electrical systems this electrical panel currently is assigned to.
(Inherited from MEPModel)
GetElectricalSystems |  Retrieves the electrical systems that are currently created using this MEPModel.
(Inherited from MEPModel)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
The Mechanical Equipment object can only be queried in Autodesk Revit MEP.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace